Revit 2027 API
MEPAnalyticalSegment.GetNetworkSegmentId Method
 Gets the NetworkSegmentId.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentId GetNetworkSegmentId()
Public Function GetNetworkSegmentId As MEPNetworkSegmentId
public:
MEPNetworkSegmentId^ GetNetworkSegmentId()
member GetNetworkSegmentId : unit -> MEPNetworkSegmentId
Return Value
MEPNetworkSegmentId
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace